{
  "skillsInNav": "Skills",
  "valuationInNav": "Valuation",
  "clientsInNav": "For clients",
  "greeting": "I'm glad to see you at my site! You're welcome to take a look at my projects and contact.",
  "projects": "Projects",
  "skills": "Skills",
  "skills-text": "I create desktop, web and mobile applications in javascript JavaScript. Feel free to contact me for any further informations.",
  "responsiveness": "Responsiveness",
  "responsiveness-text": "Every site and application that I make is fully responsive and it fits any device.",
  "fe-be-text": "In Javascripcie I know either frontend and backend technologies so I can provide multiple different things.",
  "seo-text": "I care about HTML semantics so application which I develop are initially ready for futher search engines optimization.",
  "skills-intro": "Below you can find selected projects of mine. Some of them have link to code on GitHub but most of them are commercial projects made for clients which is the reason why I can not publish their source code. Swipe to slide.",
  "two-house-text": "Responsive web application of real estate agency from Wilanów, Warsaw. It was created with Vue2JS framework. Backend as REST API was developed with PHP and its code is object oriented. For MySQL database conection I made use of PDO library. Backend contains such features as adding, editting properties, managment of types and locations of properties. Application have its own proprietary CMS which use it application API.",
  "ayc-text": "Responsive web application meant for luxury yacht charter on Mallorca. It was developed with Vue2JS. Application backend as REST API was made with PHP and its code is object oriented. For MySQL database conection I made use of PDO library.",
  "quickmargo-text": "My most complicated project. It is bot which allow to fully automate bigest polish web online dynamic RPG game. Bot automate every sphere of game and it can be managed from mobile app. Entire project is splitted into three apps - mobile, desktop and web and backend which allow those apps to comunicate between. For this project I used technologies like NodeJS, Express, MongoDB, Puppeteer, Socket.io, Vue2JS, Electron, Ionic, Angular.",
  "adminpanel-text": "Admin panel is simple proprietary CMS which is meant to manage content at my web applications. It contains several most usefull features like adding, deleting, modyfing articles shown within app, clients databases, sending newsletters etc. To develop this project I used Vue2JS and PHP.",
  "screenrecorder-text": "Recording screen desktop application. It's developed with electron and AngularJS on renderer. It can save recorded video either to online cloud (and expose URL) and local directory. It uses cloudinary API in order to save file. Project is open source and its source code is available at GitHub.",
  "colorreader-text": "Small application to pick color made with AngularJS. It shows different shades of current color. Colors can be saved to pallete which is saved in cache. You can convert colors to different formats - RGB, HEX, HSL.",
  "see": "See",
  "contact-header": "Contact / Valuation",
  "contact-text": "You're welcome to contact if you want to hire me or valuate your project.",
  "email": "E-mail address",
  "email-placeholder": "example@gmail.com",
  "phone": "Phone number (optional)",
  "message": "Message",
  "message-placeholder": "Hey! We would like to have you in our team. Check out our job offer and join us!",
  "send": "Send",
  "company": "Ltd.",
  "contact": "Contact"
}
