{
  "skillsInNav": "Umiejętności",
  "valuationInNav": "Wycena",
  "clientsInNav": "Dla klientów",
  "greeting": "Miło Cię widzieć na mojej stronie! Zapraszam do przejrzenia moich prac oraz do współpracy.",
  "projects": "Projekty",
  "skills": "Umiejętności",
  "skills-text": "Tworzę aplikacje desktopowe, webowe oraz mobilne w JavaScript. Zapraszam do kontaktu po więcej szczegółów na temat moich umiejętności technicznych.",
  "responsiveness": "Responsywność",
  "responsiveness-text": "Każda strona i aplikacja, którą tworzę jest responsywna i dopasowuje się do każdego urządzenia.",
  "fe-be-text": "W javascripcie znam zarówno technologie frontendowe jak i backendowe dzięki czemu jestem w stanie pracować nad wieloma rzeczami.",
  "seo-text": "Dbam o semantykę HTMLa dzięki czemu aplikacje, które tworze są wstępnie przygotowane pod pozycjonowanie.",
  "skills-intro": "Poniżej przedstawione są moje wybrane projekty. Niektóre projekty posiadają link do kodu na GitHubie jednakże większość z nich są projektami komercyjnymi, wykonanymi dla klientów dlatego nie mogę udostępnić ich kodu źródłowego. Przeciągnij aby przewinąć.",
  "two-house-text": "Responsywna aplikacja internetowa biura nieruchomości z Wilanowa. Została stworzona w frameworku Vue2JS. Backend w formie REST API napisany jest w PHP, kod jest zorientowany obiektowo, do połączenia z bazą danych MySQL użyłem biblioteki PDO. Backend posiada takie opcje jak dodawanie, edycja, usuwanie nieruchomości, zarządzanie typami, cechami oraz lokalizacjami nieruchomości. Aplikacja posiada autorski CMS, który korzysta z jej endpointów.",
  "ayc-text": "Responsywna aplikacja internetowa poświęcona czarterowi eksuzywnych jachtów na Majorce. Została stworzona w frameworku Vue2JS. Backend w formie REST API napisany jest w PHP, kod jest zorientowany obiektowo. Do połączenia z bazą danych MySQL użyłem biblioteki PDO.",
  "quickmargo-text": "Mój najbardziej skomplikowany projekt. Jest to bot w pełni automatyzujący największą polską dynamiczną przeglądarkową grę RPG. Bot automatyzuje wszystkie obszary gry oraz pozwala się zarządzać z poziomu telefonu. Składa się z trzech aplikacji - mobilnej, desktopowej i webowej oraz backendu, który umożliwia współpracę między nimi. Do stworzenia projektu skorzystałem z takich technologii jak NodeJS, Express, MongoDB, Puppeteer, Socket.io, Vue2JS, Electron, Ionic, Angular.",
  "adminpanel-text": "Admin panel jest to prosty autorski CMS służący do zarządzania treściami w wykonanych przeze mnie aplikacjach. Posiada różne najbardziej przydatne funkcje jak dodawanie, usuwanie, modyfikowanie artykułów widocznych w aplikacjach, bazy klientów, wysyłanie newsletterów itd. Do jego stworzenia wykorzystałem Vue2JS, PHP.",
  "screenrecorder-text": "Aplikacja desktopowa do nagrywania ekranu. Jest stworzona z Electronem oraz AngularJS. Aplikacja może zapisać nagranie zarówno na dysku jak i w chmurze i wystawić link. Używa cloudinary API w celu zapisania nagrania. Projekt open source kod jest dostępny na GitHubie.",
  "colorreader-text": "Mała aplikacja do wyboru koloru napisana w AngularJS. Pokazuje odcienie wybranego koloru. Kolory można zapisać do palety i pozostanąone w pamięci podręcznej. Można przekonwertować formaty kolorów RGB, HEX, HSL.",
  "see": "Zobacz",
  "contact-header": "Kontakt / Wycena",
  "contact-text": "Zapraszam do kontaktu jeśli chcesz podjąć współpracę lub wycenić swój projekt.",
  "email": "Adres e-mail",
  "email-placeholder": "przyklad@gmail.com",
  "phone": "Number telefonu (opcjonalne)",
  "message": "Wiadomość",
  "message-placeholder": "Hej! Chcielibyśmy mieć Cie w naszym zespole. Sprawdź naszą ofertę pracy i dołącz do nas!",
  "send": "Wyślij"
}
